Merge branch 'dev' of https://github.com/aaron-fredrick/COMP3008 into dev
